cask_args appdir: "/Applications"

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

#
# Brew
#   https://formulae.brew.sh/
#
brew "actionlint"
brew "awscli"
brew "bash-completion"
brew "diff-so-fancy"
brew "direnv"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "ghq"
brew "git"
brew "git-secrets"
brew "github/gh/gh"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "graphicsmagick"
brew "grep"
brew "gzip"
brew "hub"
brew "kubectl"
brew "kubectx"
brew "libmcrypt"
brew "mas" if OS.mac?
brew "openssl"
brew "peco"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "rename"
brew "rename"
brew "tig"
brew "trash"
brew "tree"
brew "watch"
brew "webkit2png"
brew "wget"

#
# Cask
#   https://formulae.brew.sh/cask/
#
cask "1password"
cask "adobe-acrobat-reader"
cask "bettertouchtool"
cask "clipy"
cask "deepl"
cask "docker"
cask "google-cloud-sdk"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "intellij-idea"
cask "karabiner-elements"
cask "macvim"
cask "meetingbar"
cask "postman"
cask "postman"
# cask "qlmarkdown"
# cask "qlprettypatch"
# cask "qlstephen"
cask "quicklook-json"
cask "scroll-reverser"
cask "skitch"
cask "skitch"
cask "slack"
cask "slack"
cask "tableplus"
cask "tableplus"
cask "vlc"
cask "visual-studio-code"
cask "wireshark"
cask "wireshark"

#
# Mac App Store
#   https://github.com/mas-cli/mas
#
mas "MeetingBar for Meet, Zoom & Co", id: 1532419400
