cask_args appdir: "/Applications"

tap "hashicorp/tap"

#
# Brew
#   https://formulae.brew.sh/
#
brew "actionlint"
brew "awscli"
brew "bash-completion"
brew "diff-so-fancy"
brew "direnv"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gh"
brew "gnu-sed"
brew "go"
brew "golang-migrate"
brew "gpg"
brew "graphicsmagick"
brew "grep"
brew "gzip"
brew "hub"
brew "kubectl"
brew "kubectx"
brew "mas" if OS.mac?
brew "openssl"
brew "peco"
brew "pinentry-mac"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "rename"
brew "rename"
brew "rg"
brew "sqlc"
brew "terraform"
brew "tig"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "webkit2png"
brew "wget"

#
# Cask
#   https://formulae.brew.sh/cask/
#
cask "1password"
cask "adobe-acrobat-reader"
cask "bettertouchtool"
cask "clipy"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "meetingbar"
cask "postman"

cask "scroll-reverser"
cask "slack"
cask "tableplus"
cask "vlc"
cask "visual-studio-code"
cask "steipete/tap/repobar"

#
# Mac App Store
#   https://github.com/mas-cli/mas
#
mas "MeetingBar for Meet, Zoom & Co", id: 1532419400
